'''
Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

Пример:

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
'''

list = [2, 3, 5, 6]
list2 = [2, 3, 4, 5, 6]

def mult(x):
    if len(x) % 2 != 0:
        lenX = len(x) // 2 + 1 
    else:
        lenX = len(x) // 2
    result = [x[i] * x[len(x) - i - 1] for i in range(lenX)]
    return print(result)

mult(list)
mult(list2)